In [9]:
import pandas as pd
import numpy as np
import seaborn as sns
from matplotlib import pyplot as plt
path = "Dataset.xlsx"

In [5]:
file = pd.ExcelFile(path)

dfs = {sheet_name: file.parse(sheet_name) 
          for sheet_name in file.sheet_names}

In [6]:
dfs.keys()

dict_keys(['Material_Data_Dict', 'Comp_Data_Dict', 'CS', 'SS(Ave)', 'SS1', 'SS2', 'FE', 'AT1', 'AT2', 'AT3', 'AT4', 'AT5', 'AT(Ave)'])

In [150]:
class DataCleaner:
    
    def __init__(self, path):
        file = pd.ExcelFile(path)
        dfs = {sheet_name: file.parse(sheet_name) 
          for sheet_name in file.sheet_names}
        self.dfs = dfs
        colsa = ['BOD','NH3-N','PH','TN'] # ss avg columns
        colsb = ['MLSS', 'AT_Temp'] # at avg columns
        self.df = pd.concat([ dfs['SS(Ave)'][colsa] , dfs['AT(Ave)'][colsb] ], axis = 1)
        self.odf = dfs['FE'][['BOD', "NH3-N", 'TN']]
    
    def get_bod(self):
        dfs = self.dfs
        self.bod = dfs['FE']['BOD']
        return self.bod
        #display(self.bod)
    def get_nh3(self):
        dfs = self.dfs
        self.nh3 = dfs['FE']['NH3-N']
        return self.nh3
        #display(self.nh3)
    def get_tn(self):
        dfs = self.dfs
        self.tn = dfs['FE']['TN']
        return self.tn
        #display(self.tn)
        
    def first_df(self):
        return pd.concat([self.df, self.get_bod()], axis = 1)
    def second_df(self):
        return pd.concat([self.df, self.get_nh3()], axis = 1)
    def third_df(self):
        return pd.concat([self.df, self.get_tn()], axis = 1)

In [151]:
dc = DataCleaner(path)
dc.df

        BOD  NH3-N   PH    TN    MLSS  AT_Temp
0       NaN   25.0  7.4   NaN     NaN   21.350
1       NaN    NaN  NaN   NaN  2540.0   21.850
2     120.0   31.0  8.1  45.0     NaN   22.400
3       NaN    NaN  NaN   NaN  2230.0   21.975
4       NaN    NaN  NaN   NaN     NaN   21.100
...     ...    ...  ...   ...     ...      ...
2186  120.0   31.0  7.3  56.0  3430.0   23.150
2187    NaN    NaN  NaN   NaN  3330.0   21.925
2188    NaN    NaN  NaN   NaN     NaN   21.075
2189    NaN   29.0  7.2   NaN     NaN   20.700
2190    NaN   30.0  7.4   NaN  3290.0   20.700

[2191 rows x 6 columns]

In [152]:
ind = dc.get_bod().notna()
ind

0        True
1       False
2        True
3       False
4       False
        ...
2186     True
2187    False
2188    False
2189    False
2190    False
Name: BOD, Length: 2191, dtype: bool

In [153]:
dc.odf[ind]

      BOD  NH3-N    TN
0     5.0   0.50   9.4
2     5.0   0.54  11.0
7     5.0   0.59   8.9
8     5.0   0.70   NaN
9     5.0   0.98  12.0
...   ...    ...   ...
2178  5.0   0.50   NaN
2179  5.0   0.50   4.7
2184  5.0   0.50   3.9
2185  5.0   0.50   NaN
2186  5.0   0.50   3.8

[931 rows x 3 columns]

In [158]:
df1 = dc.first_df()
df2 = dc.second_df()
df3 = dc.third_df()
display(df1)
display(df2)
display(df3)

        BOD  NH3-N   PH    TN    MLSS  AT_Temp  BOD
0       NaN   25.0  7.4   NaN     NaN   21.350  5.0
1       NaN    NaN  NaN   NaN  2540.0   21.850  NaN
2     120.0   31.0  8.1  45.0     NaN   22.400  5.0
3       NaN    NaN  NaN   NaN  2230.0   21.975  NaN
4       NaN    NaN  NaN   NaN     NaN   21.100  NaN
...     ...    ...  ...   ...     ...      ...  ...
2186  120.0   31.0  7.3  56.0  3430.0   23.150  5.0
2187    NaN    NaN  NaN   NaN  3330.0   21.925  NaN
2188    NaN    NaN  NaN   NaN     NaN   21.075  NaN
2189    NaN   29.0  7.2   NaN     NaN   20.700  NaN
2190    NaN   30.0  7.4   NaN  3290.0   20.700  NaN

[2191 rows x 7 columns]

        BOD  NH3-N   PH    TN    MLSS  AT_Temp  NH3-N
0       NaN   25.0  7.4   NaN     NaN   21.350   0.50
1       NaN    NaN  NaN   NaN  2540.0   21.850    NaN
2     120.0   31.0  8.1  45.0     NaN   22.400   0.54
3       NaN    NaN  NaN   NaN  2230.0   21.975    NaN
4       NaN    NaN  NaN   NaN     NaN   21.100    NaN
...     ...    ...  ...   ...     ...      ...    ...
2186  120.0   31.0  7.3  56.0  3430.0   23.150   0.50
2187    NaN    NaN  NaN   NaN  3330.0   21.925    NaN
2188    NaN    NaN  NaN   NaN     NaN   21.075    NaN
2189    NaN   29.0  7.2   NaN     NaN   20.700   0.50
2190    NaN   30.0  7.4   NaN  3290.0   20.700   0.50

[2191 rows x 7 columns]

        BOD  NH3-N   PH    TN    MLSS  AT_Temp    TN
0       NaN   25.0  7.4   NaN     NaN   21.350   9.4
1       NaN    NaN  NaN   NaN  2540.0   21.850   NaN
2     120.0   31.0  8.1  45.0     NaN   22.400  11.0
3       NaN    NaN  NaN   NaN  2230.0   21.975   NaN
4       NaN    NaN  NaN   NaN     NaN   21.100   NaN
...     ...    ...  ...   ...     ...      ...   ...
2186  120.0   31.0  7.3  56.0  3430.0   23.150   3.8
2187    NaN    NaN  NaN   NaN  3330.0   21.925   NaN
2188    NaN    NaN  NaN   NaN     NaN   21.075   NaN
2189    NaN   29.0  7.2   NaN     NaN   20.700   NaN
2190    NaN   30.0  7.4   NaN  3290.0   20.700   NaN

[2191 rows x 7 columns]

In [157]:
dc.first_df().columns

Index(['BOD', 'NH3-N', 'PH', 'TN', 'MLSS', 'AT_Temp', 'BOD'], dtype='object')